welcome_text = """
Привет! Выбери направление, которое ты хотел бы изучить.
Если тебе трудно определиться, нажми кнопку "Затрудняюсь..."
и мы поподробней расскажем о каждом из направлений.
"""

skill_text = "Выберите навык, который хотите изучить."


trouble = {
    "prog": (
        "Программирование",
        "Программи́рование — процесс создания компьютерных программ. "
        "По выражению одного из основателей языков программирования"
        " Никлауса Вирта «Программы = алгоритмы + структуры данных». "
        "Программирование "
        "основывается на использовании языков программирования, "
        "на которых записываются исходные тексты программ.",
    ),
    "design": (
        "Дизайн",
        "Дизайн — деятельность по проектированию эстетических "
        "свойств промышленных изделий,"
        " а также результат этой деятельности",
    ),
    "analytics": (
        "Аналитика",
        "Аналитика — часть искусства рассуждения — логики, "
        "рассматривающая учение об анализе — операции мысленного"
        " или реального расчленения целого на составные части,"
        " выполняемая в процессе познания или предметно-практической"
        " деятельности человека.",
    ),
}

trouble_desc = "Выберите категорию"
